{
  "backend/main.mo": "Main Motoko actor implementing a job marketplace with candidate profiles, job postings, applications, and role-based access control. Includes CRUD operations for jobs, candidates, applications, and user profile management with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting the removal of 'Built with caffeine.ai' attribution from the Footer component, listing affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON summary of four frontend components: CandidateProfileForm (profile creation/editing), JobRecommendations (personalized job matching), CandidateProfileView (read-only profile display), and Footer (copyright display).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Autohire application with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for employer/candidate dashboards, job postings, applications, and profile pages. Includes ThemeProvider, authentication check, and UserProfileSetup modal.",
  "frontend/src/components/ApplicationForm.tsx": "Form component for submitting job applications with optional fields for expected salary, cover letter, and resume URL. Validates candidate profile existence before submission.",
  "frontend/src/components/ApplicationList.tsx": "Displays list of job applications with status badges, candidate/job info based on user role, and employer-only status update dropdown. Shows application details like cover letter and resume links.",
  "frontend/src/components/AuthGuard.tsx": "Authentication wrapper component that checks user login status and optional role requirements, displaying login prompt or access denied message when conditions aren't met.",
  "frontend/src/components/CandidateProfileForm.tsx": "Form component for creating/editing candidate profiles with fields for personal info, skills, location, hourly rate, portfolio links, availability, and preferred job types. Handles form submission via useSaveCandidateProfile hook and displays toast notifications.",
  "frontend/src/components/CandidateProfileView.tsx": "Read-only display component for candidate profiles showing personal details, availability status, skills, preferred job types, portfolio links, and resume. Uses Card components to organize information into sections.",
  "frontend/src/components/CandidateSearch.tsx": "Search and filter component with a search input field and optional employment type dropdown selector. Accepts callbacks for search term and type filter changes.",
  "frontend/src/components/EmployerJobPostingCard.tsx": "Card component displaying job posting details for employers with edit/delete actions, application count, and navigation to view applications. Includes confirmation dialog for deletion.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an image, title, description, and optional action button for when no data is available.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information with the current year and company name.",
  "frontend/src/components/FreelanceJobCard.tsx": "Card component for displaying freelance job postings with project details, salary range, skills, and an apply button that opens ApplicationForm in a dialog. Styled with primary theme colors.",
  "frontend/src/components/JobCard.tsx": "Card component for displaying regular job postings with employment type, company info, salary range, skills, application deadline, and an apply button that opens ApplicationForm in a dialog.",
  "frontend/src/components/JobPostingForm.tsx": "Form component for creating and editing job postings with fields for title, company, location, salary, skills, and other job details. Handles submission via create/update mutations and displays success/error toasts.",
  "frontend/src/components/JobRecommendations.tsx": "Displays personalized job recommendations for candidates by filtering active jobs based on their skills and preferred job types. Shows up to 6 matching jobs in a grid layout.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the app with Navigation header, main content outlet, and Footer. Provides consistent page structure across routes.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/Navigation.tsx": "Main navigation header with role-based menu links for employers and candidates, mobile sheet menu, and LoginButton. Shows different navigation options based on user authentication and role.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and select a role (employer or candidate). Cannot be dismissed until profile is created.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useApplications.ts": "Provides React Query hooks for job application operations: applying to jobs, fetching job applications, fetching user applications, and updating application status. All mutations invalidate relevant queries on success.",
  "frontend/src/hooks/useCandidateProfile.ts": "Provides hooks for fetching the caller's candidate profile and saving/updating candidate profile data including personal info, skills, experience, education, and preferences. Invalidates profile queries on successful save.",
  "frontend/src/hooks/useCandidates.ts": "Provides hooks for filtering candidates by skills and experience level, and fetching individual candidate profiles by user ID using Principal conversion.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useJobPostings.ts": "React Query hooks for job posting CRUD operations (get, create, update, delete) that interact with the backend actor and manage cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile, with automatic cache invalidation on updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a warm, professional color palette (teal primary), dark mode support, typography enhancements, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CandidateBrowse.tsx": "Job browsing page for candidates with search and filter functionality, displaying active job postings in a card grid layout with empty state handling.",
  "frontend/src/pages/CandidateDashboard.tsx": "Candidate dashboard showing application statistics, profile completion status, and personalized job recommendations with quick action buttons.",
  "frontend/src/pages/CandidateProfile.tsx": "Candidate profile management page with view/edit modes, allowing users to create or update their professional profile information.",
  "frontend/src/pages/EmployerDashboard.tsx": "Employer dashboard displaying job posting statistics, active listings, and quick actions for managing postings and searching candidates.",
  "frontend/src/pages/EmployerJobPostings.tsx": "Employer dashboard page for managing job postings with create/edit functionality via a dialog form. Filters job postings by employer identity and displays them in a grid with empty state handling.",
  "frontend/src/pages/FreelanceMarketplace.tsx": "Public marketplace page displaying freelance and contract job opportunities with search filtering. Shows active jobs filtered by employment type in a card grid layout.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section and feature cards showcasing the platform's capabilities. Auto-redirects authenticated users to their role-specific dashboard (employer or candidate).",
  "frontend/src/pages/JobApplications.tsx": "Employer-only page showing all applications for a specific job posting. Validates job ownership and displays application list with job details card.",
  "frontend/src/pages/MyApplications.tsx": "Candidate-only page displaying all job applications submitted by the logged-in user. Shows application status tracking with empty state and navigation to job browsing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing. Includes sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom design tokens using OKLCH color space, extended theme with container settings, custom animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file for Autohire platform tracking 8 implemented features including job posting system, candidate profiles, application management, freelancing marketplace, and dashboards for both employers and candidates. Currently at version 5 with no known issues or pending fix requests."
}
